Revit 2027 API
FabricSheet.FabricAreaOwnerId Property
 The Fabric Area Id.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId FabricAreaOwnerId { get; }
Public ReadOnly Property FabricAreaOwnerId As ElementId
	Get
public:
property ElementId^ FabricAreaOwnerId {
	ElementId^ get ();
}
member FabricAreaOwnerId : ElementId with get
Property Value
ElementId
See Also
Reference
FabricSheet Class
Autodesk.Revit.DB.Structure Namespace